"""
เกี่ยวกับการใช้ตัวแปรใน String ด้วย f-string:

- f-string ใช้สำหรับสร้าง String ที่มีการแทรกค่าของตัวแปรเข้าไป
- ใส่ `f` ไว้ข้างหน้าเครื่องหมายคำพูดเปิด (`"`) เพื่อระบุว่าเป็น f-string
- ใส่ชื่อตัวแปรที่ต้องการแทรกค่าไว้ในวงเล็บปีกกา (`{}`) ภายใน f-string
- Python จะแทนที่ชื่อตัวแปรด้วยค่าของมันเมื่อแสดงผล String

f-string เป็นเครื่องมือที่มีประโยชน์ ช่วยให้สร้าง String ที่มีการแทรกค่าตัวแปรได้อย่างสะดวกและยืดหยุ่น
"""

first_name = "ada"
last_name = "lovelace"
full_name = f"{first_name} {last_name}"
print(f"Hello, {full_name.title()}!")