"""
ในการเขียนโปรแกรม เราต้องทำการกำหนดและรวบรวมข้อมูล แล้วนำข้อมูลเหล่านั้นมาใช้งานให้เกิดประโยชน์ การจำแนกประเภทของข้อมูลจึงเป็นเรื่องสำคัญ โดยประเภทข้อมูลแรกที่เราจะพูดถึงคือ String (สตริง) ซึ่งอาจดูเหมือนเป็นเรื่องง่ายๆ ในทีแรก แต่เราสามารถใช้งาน String ได้หลากหลายวิธี

String คือ ชุดของอักขระ (ตัวอักษร ตัวเลข และสัญลักษณ์พิเศษ) ใดๆ ก็ตามที่อยู่ภายในเครื่องหมายคำพูด (Quotes) ไม่ว่าจะเป็นเครื่องหมายคำพูดเดี่ยว (') หรือคำพูดคู่ (") ก็ถือว่าเป็น String ทั้งหมด

ตัวอย่างเช่น:

```python
# ใช้เครื่องหมายคำพูดคู่
string1 = "นี่คือ String"

# ใช้เครื่องหมายคำพูดเดี่ยว 
string2 = 'นี่ก็คือ String เช่นกัน'
```

ความยืดหยุ่นนี้ทำให้เราสามารถใช้เครื่องหมายคำพูดและอัญประกาศภายใน String ของเราได้ เช่น:

```python
# ใช้เครื่องหมายคำพูดเดี่ยวครอบ String ที่มีเครื่องหมายคำพูดคู่อยู่ข้างใน
string3 = 'เพื่อนฉันบอกว่า "Python เป็นภาษาที่ฉันชอบที่สุด!"'

# ใช้เครื่องหมายคำพูดคู่ครอบ String ที่มีเครื่องหมายคำพูดเดี่ยวอยู่ข้างใน
string4 = "ภาษา 'Python' ตั้งชื่อตามรายการตลก Monty Python ไม่ใช่ตั้งตามงูนะ"

# ใช้เครื่องหมายคำพูดคู่ครอบ String ที่มีอัญประกาศเดี่ยวอยู่ข้างใน
string5 = "จุดแข็งของ Python อย่างหนึ่งคือ มีชุมชนที่หลากหลายและเต็มไปด้วยการสนับสนุน"
```

ตอนนี้ลองมาดูวิธีการใช้งาน String กันบ้าง
"""